<template>
  <div>
    <div class="tos p-5">
      <div class="mb-4">
        <h1 class="mb-1">利用規約</h1>
        <p class="mb-4">
          この利用規約（以下「本規約」といいます。）は、本ウェブサイト上で提供するサービス（以下「本サービス」といいます。）の利用条件を定めるものです。
          本サービスの利用者（以下「利用者」といいます。）は、本規約に同意していただいた上で、本サービスをご利用いただきます。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第１条（規約の規定）</h2>
        <p class="mb-4">
          本規約は、本サービスの提供条件及び本サービス運営者（以下「運営者」といいます。）と利用者との間の権利義務関係を定めることを目的とし、
          利用者と運営者との間のサービスの利用に関わる一切の関係に適用されるものとします。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第２条（禁止事項）</h2>
        <p class="mb-1">
          利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。
        </p>
        <ul>
          <li>法令または公序良俗に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>本サービスの内容等、本サービスや第三者の著作権、商標権ほか知的財産権などの権利を侵害する行為</li>
          <li>運営者、他の利用者、またはその他の第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
          <li>本サービスによって得られた情報を商業的に利用する行為</li>
          <li>本サービスの運営を妨害する、またはそのおそれがある行為</li>
          <li>不正アクセスをする、またはこれを試みる行為</li>
          <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
          <li>不正な目的を持って本サービスを利用する行為</li>
          <li>本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為</li>
          <li>他のユーザーになりすます行為</li>
          <li>運営者が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
          <li>性行為やわいせつな行為を目的とする行為、面識のない異性との出会いや交際を目的とする行為、他者に対する嫌がらせや誹謗中傷</li>
          <li>本サービスに関連して、反社会的勢力に対して直接的または間接的に利益を供与する行為</li>
          <li>その他、運営者が不適切と判断する行為</li>
        </ul>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第３条（本サービスの提供の停止等）</h2>
        <p class="mb-1">
          運営者は、以下のいずれかの事由があると判断した場合、利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
        </p>
        <ul class="mb-1">
          <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
          <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
          <li>コンピュータまたは通信回線等が事故いより停止した場合</li>
          <li>本サービスが利用しているクラウドサービスが停止した場合</li>
          <li>その他、運営者が本サービスの提供が困難と判断した場合</li>
        </ul>
        <p>
          運営者は、本サービスの提供の停止または中断により、利用者または第三者が被ったいかなる損害または不利益について、理由を問わず一切の責任を負わないものとする。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第４条（保証の否認および免責事項）</h2>
        <p class="mb-2">
          運営者は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
        </p>
        <p>
          運営者は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第５条（サービス内容の変更等）</h2>
        <p>
          運営者は、利用者に通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第６条（利用規約の変更）</h2>
        <p>
          運営者は、必要と判断した場合には、利用者に通知することなくいつでも本規約を変更することができるものとします。
          なお、本規約の変更後、本サービスの利用を開始した場合には、当該利用者は変更後の規約に同意したものとみなします。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第７条（通知または連絡）</h2>
        <p>
          利用者と運営者との間の通知または連絡は、運営者の定める方法によって行うものとします。
        </p>
      </div>

      <div class="mb-4">
        <h2 class="mb-1">第８条（準拠法・裁判管轄）</h2>
        <p>
          本規約の解釈にあたっては、日本法を準拠法とします。
          本サービスに関して紛争が生じた場合には、横浜地方裁判所を第一審の専属的合意管轄裁判所とします。
        </p>
      </div>

      <p class="text-right">以上</p>
    </div>
    <nuxt-link class="button wrapper-icons" to="/">
      <fa :icon="faHome" />
    </nuxt-link>
  </div>
</template>

<script>
import { faHome } from '@fortawesome/free-solid-svg-icons'

export default {
  computed: {
    faHome() { return faHome }
  }  
}
</script>

<style lang="scss" scoped>
@import '@/assets/css/_color.scss';
h1 {
  font-size: 1.5rem;
  font-weight: bold;
}

h2 {
  font-size: 1.25rem;
  font-weight: 700;
}

p {
  line-height: 1.75rem;
}

ul {
  list-style-type: decimal;
  margin-left: 2rem;
  li {
    line-height: 1.5rem;
  }
}

.tos {
  text-align: left;
  box-shadow: inset 3px 3px 5px darken($primary, 20%), inset -3px -3px 5px lighten($primary, 10%);
  @media screen and (min-width: 895px) {
    margin: 2.5rem;
  }
}
</style>